Tekla Open API Reference for Tekla Structures 2025
AnalysisPartPositionProperties Properties
The AnalysisPartPositionProperties type exposes the following members.
Properties
Name | Description
AxisCoordinateX
 The axis coordinate in the X direction.
AxisCoordinateY
 The axis coordinate in the Y direction.
AxisCoordinateZ
 The axis coordinate in the Z direction.
AxisLocation
 The axis location of the analysis part.
AxisModifierX
 The axis modifier in the X direction.
AxisModifierY
 The axis modifier in the Y direction.
AxisModifierZ
 The axis modifier in the Z direction.
AxisOffset
 The axis offset of the analysis part (in the global coordinate system).
KeepAxis
 The keep axis setting of the analysis part.
LongitudinalOffsetMode
 The longitudinal offset mode.
Top
See Also
Reference
AnalysisPartPositionProperties Class
Tekla.Structures.Analysis Namespace